app/controllers/cat_rental_requests_controller.rb

  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    @rental_request.user = current_user
    if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 2], ["created_at", "2015-09-17 00:57:12.090760"], ["end_date", "2015-09-25"], ["start_date", "2015-09-16"], ["status", "PENDING"], ["updated_at", "2015-09-17 00:57:12.090760"]]