app/views/cats/show.html.erb

SELECT users.user_name AS renter_name FROM "cat_rental_requests" INNER JOIN "users" ON "users"."id" = "cat_rental_requests"."user_id" WHERE "cat_rental_requests"."cat_id" = $1  ORDER BY start_date  [["cat_id", 3]]
---
  </tr>
  <% @cat.rental_requests
       .select("cat_rental_requests.*, users.user_name")
       .from("cat_rental_requests")
       .joins(:user)
       .order("start_date")
       .each do |req| %>